In [124]:
import numpy as np
import pandas as pd

In [125]:
s = pd.Series(range(10))
s[3] = np.nan   #series의 3번값이 NaN으로 출력됨을 확인가능
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [126]:
s.count()

9

In [127]:
np.random.seed(42)

df = pd.DataFrame(np.random.randint(5, size =(4,4)), dtype=float)
df.iloc[2,3] = np.nan
df

     0    1    2    3
0  3.0  4.0  2.0  4.0
1  4.0  1.0  2.0  2.0
2  2.0  4.0  3.0  NaN
3  4.0  1.0  3.0  1.0

In [183]:
df.count()  #value의 갯수를 카운트해준다.

0    4
1    4
2    4
3    3
dtype: int64

In [129]:
df[1].value_counts() #df의 column 1의 갯수를 카운트 4.0이 2개 1.0이 2개

1
4.0    2
1.0    2
Name: count, dtype: int64

In [130]:
#pip install seaborn

Requirement already satisfied: seaborn in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (0.13.2)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from seaborn) (1.26.4)
Requirement already satisfied: pandas>=1.2 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from seaborn) (2.2.1)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from seaborn) (3.8.3)
Requirement already satisfied: contourpy>=1.0.1 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.2.0)
Requirement already satisfied: cycler>=0.10 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.49.0)
Requirement already satisfied: kiwisolver>=1.3.1 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.5)
Requirement already satisfied: packaging>=20.0 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (23.1)
Requirement already satisfied: pillow>=8 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (10.2.0)
Requirement already satisfied: pyparsing>=2.3.1 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.1.1)
Requirement already satisfied: python-dateutil>=2.7 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: six>=1.5 in /Users/jaewoo/miniconda3/lib/python3.11/site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [131]:
import seaborn as sns
titanic = sns.load_dataset('titanic')   #seaborn의 titanic데이터셋 불러오기
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [132]:
titanic.count() #titanic의 각 columns의 데이터 갯수 확인
#titanic[titanic.columns].count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [133]:
titanic.info()  #info를 통해 titanic의 Null값 데이터의 수 데이터타입 등을 확인할 수 있다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [185]:
np.random.seed(1)   #램덤한 seed1 예측이 가능한 램덤을 생성한다.
s2 = pd.Series(np.random.randint(6, size=100)) #0~5까지의 수를 길이가 100인 넘파이배열을 생성해 판다스의 시리즈형태에 만들어 s2에 저장
s2.tail(10)# 뒤에서 10개 출력 90~99번이 출력됨을 볼 수 있음

90    3
91    0
92    0
93    5
94    5
95    4
96    5
97    2
98    4
99    3
dtype: int64

In [135]:
s2.value_counts() #value의 갯수 value 1이 22개 0이 18개...

1    22
0    18
4    17
5    16
3    14
2    13
Name: count, dtype: int64

In [136]:
s2.value_counts().sort_index()  #sort가 0부터 5까지 오름차순으로 출력됨

0    18
1    22
2    13
3    14
4    17
5    16
Name: count, dtype: int64

In [137]:
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [138]:
s.sort_values() #sort_value시 값이 NaN, 없다면 가장 마지막에 나오게 된다.

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [139]:
s.sort_values(ascending=False)  #ascending=False 시 내림차순으로 변경된다. 내림차순 역시 NaN은 제일 아래에 출력됨

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [189]:
titanic[['sex','age','class','alive']].sort_values(by=['sex']).value_counts().head(10) #타이타닉 데이터셋에서 'sex', 'age', 'class', 'alive' 열을 선택하고, 'sex' 열을 기준으로 정렬

sex   age   class  alive
male  22.0  Third  no       13
      21.0  Third  no       12
      19.0  Third  no       11
      28.0  Third  no       10
      20.0  Third  no       10
      25.0  Third  no        9
      26.0  Third  no        9
      24.0  Third  no        8
      16.0  Third  no        8
      30.0  Third  no        7
Name: count, dtype: int64

In [141]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8))) # 0~9까지 4 * 8의 배열을 생성 후 데이터프레임화 
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [142]:
df2.sum(axis=1) #각 index에 대한 value의 합

0    35
1    34
2    41
3    42
dtype: int64

In [143]:
df2["RowSum"] = df2.sum(axis=1) #데이터프레임에 존재하지 않은 열이면 추가 존재하는 값이면 덮어쓰게됨
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [144]:
df3 = pd.DataFrame({
    'A' : [1, 2, 3, 3, 4],
    'B' : [2, 3, 1, 2, 3],
    'C' : [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  2  3  5
2  3  1  2
3  3  2  4
4  4  3  4

In [145]:
df3.apply(lambda x: x.max() - x.min())  #열기준 최댓값 - 최솟값

A    3
B    2
C    4
dtype: int64

In [146]:
df3.apply(lambda x: x.max() - x.min(), axis=1) #행기준 최댓값 - 최솟값

0    1
1    3
2    2
3    2
4    1
dtype: int64

In [147]:
titanic['adult/child'] = titanic.apply(lambda r: 'adult' if r.age >= 20 else 'child', axis = 1) #람다식을 이용하여 adult/child 열을 만들고 그 안의 값을 'age'가 20이상이면 adult 아니라면 child로 저장
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

NaN값은 fillna메서드를 사용하여 원하는 값으로 바꿀 수 있음

In [148]:
df

     0    1    2    3
0  3.0  4.0  2.0  4.0
1  4.0  1.0  2.0  2.0
2  2.0  4.0  3.0  NaN
3  4.0  1.0  3.0  1.0

In [149]:
df.apply(pd.value_counts)   #각 column값의 빈도를 카운트해 계산한 결과

/var/folders/zy/q5wzz21s04x4lr52n6t2zq080000gn/T/ipykernel_92359/4221818830.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  df.apply(pd.value_counts)

       0    1    2    3
1.0  NaN  2.0  NaN  1.0
2.0  1.0  NaN  2.0  1.0
3.0  1.0  NaN  2.0  NaN
4.0  2.0  2.0  NaN  1.0

In [150]:
df.apply(pd.value_counts).fillna(0.0)   #NaN값을 0.0으로 채움

/var/folders/zy/q5wzz21s04x4lr52n6t2zq080000gn/T/ipykernel_92359/2185269511.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  df.apply(pd.value_counts).fillna(0.0)

       0    1    2    3
1.0  0.0  2.0  0.0  1.0
2.0  1.0  0.0  2.0  1.0
3.0  1.0  0.0  2.0  0.0
4.0  2.0  2.0  0.0  1.0

In [152]:
df3

   A  B  C
0  1  2  1
1  2  3  5
2  3  1  2
3  3  2  4
4  4  3  4

In [153]:
df3.apply(pd.value_counts)

/var/folders/zy/q5wzz21s04x4lr52n6t2zq080000gn/T/ipykernel_92359/3610007328.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  1.0  2.0  1.0
3  2.0  2.0  NaN
4  1.0  NaN  2.0
5  NaN  NaN  1.0

In [154]:
df3.apply(pd.value_counts).fillna(0).astype(int)    #fillna(0) NaN을 0으로 채워주고 astype(int)인트형으로 캐스팅

/var/folders/zy/q5wzz21s04x4lr52n6t2zq080000gn/T/ipykernel_92359/3039969621.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  1  2  1
3  2  2  0
4  1  0  2
5  0  0  1

In [160]:
ages = [3, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 99]

In [159]:
# bins 인수는 카테고리를 나누는 기준
bins = [1, 20, 30, 50, 70, 100]
labels = ['미성년자', '청년', '중년', '장년', '노년']
cats = pd.cut(ages, bins, labels=labels)
cats

['미성년자', '미성년자', '미성년자', '미성년자', '미성년자', ..., '장년', '미성년자', '중년', '중년', '노년']
Length: 14
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [161]:
type(cats)  #카테고리 타입임을 확인

pandas.core.arrays.categorical.Categorical

In [162]:
cats.categories # labels의 값이 카테고리화 된걸 볼 수 있다.

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [163]:
cats.codes

array([0, 0, 0, 0, 0, 1, 1, 2, 2, 3, 0, 2, 2, 4], dtype=int8)

In [165]:
df4 = pd.DataFrame(ages, columns=['ages'])
df4['age_cat'] = pd.cut(df4.ages, bins, labels=labels)
df4

    ages age_cat
0      3    미성년자
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20    미성년자
9     41      중년
10    32      중년
11    99      노년

In [166]:
# age_cat 열값을 astype 메서드 사용해서 문자열로 바꾸기
df4.age_cat.astype(str) + df4.ages.astype(str)

0      미성년자3
1      미성년자2
2     미성년자10
3       청년21
4       청년23
5       중년37
6       중년31
7       장년61
8     미성년자20
9       중년41
10      중년32
11      노년99
dtype: object

In [167]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=['Q1', 'Q2', ' Q3', 'Q4'])
cats

['Q2', 'Q1', 'Q2', ' Q3', 'Q1', ..., 'Q1', 'Q1', 'Q4', 'Q4', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < ' Q3' < 'Q4']

In [169]:
pd.value_counts(cats)

/var/folders/zy/q5wzz21s04x4lr52n6t2zq080000gn/T/ipykernel_92359/1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

Q1     250
Q2     250
 Q3    250
Q4     250
Name: count, dtype: int64

### 그룹분석

- size,count 
- mean, median, min, max
- sum, prod, std, var, quantile
- first, last

In [170]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1' : ['A', 'A', 'B', 'B', 'A'],
    'key2' : ['one', 'two', 'one', 'two', 'one'],
    'data1' : [1, 2, 3, 4, 5],
    'data2' : [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [173]:
groups = df2.groupby(df2.key1)
groups.groups   #인덱스를 저장한 groups속성 확인

{'A': [0, 1, 4], 'B': [2, 3]}

In [175]:
groups.sum()    #A그룹과 B그룹 데이터의 합계

           key2  data1  data2
key1
A     onetwoone      8     80
B        onetwo      7     70

In [176]:
#열 data1에 대해서만 그룹연산을 하고싶으면
df2.data1.groupby(df2.key1).sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [177]:
#2
df2.groupby(df2.key1)['data1'].sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [179]:
#3
df2.groupby(df2.key1).sum()['data1']

key1
A    8
B    7
Name: data1, dtype: int64